MichelGauvin/esp32_beer_ferm_ctrl/src/main.cpp
/*
  Arduino PID fermentation temperature Controller (x4)
  Made by Michel Gauvin
  www.mikesbrewshop.com

  TODO:
  - Master pump control let the operator to force the pump ON for the desired duration via web command
  - Implement a cold crash process

  BUG:
  - Il y a un bug avec le windows start time, on devrait le resetter lorsqu'on met le PID à "ON"
  Il est seulement initialisé lors du démarrage de l'application.
*/

#include <OneWire.h>
#include <DallasTemperature.h>
#include <MovingAverage.h>
#include <SPI.h>
#include <PID_v1.h>
#include "EEPROM.h"
#include <ESP8266WiFi.h>
#include <Hash.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <LittleFS.h>
#include <ESPAsyncWiFiManager.h>
#include <ArduinoJson.h>
#include <WebSocketsServer.h>

#define RELAY1 12
#define RELAY2 13
#define RELAY3 14
#define RELAY4 15

#define ONE_WIRE_BUS 4

// These are the mandatory persistent values
// If the controller reboot, it will start from the last known state
#define EEPROM_ADDR_SETPOINT1 0
#define EEPROM_ADDR_SETPOINT2 4
#define EEPROM_ADDR_SETPOINT3 8
#define EEPROM_ADDR_SETPOINT4 12
#define EEPROM_ADDR_FERM1STATUS 16
#define EEPROM_ADDR_FERM2STATUS 17
#define EEPROM_ADDR_FERM3STATUS 18
#define EEPROM_ADDR_FERM4STATUS 19

//Test pour recevoir un paramètre.
const char* PARAM_INPUT_1 = "input1";

// Create AsyncWebServer object on port 80
AsyncWebServer server(80);
DNSServer dns;

//************************ PID DEFINITION *************************
// Define Variables we'll be connecting to
double ferm1_Setpoint, ferm1_Input, ferm1_Output;
double ferm2_Setpoint, ferm2_Input, ferm2_Output;
double ferm3_Setpoint, ferm3_Input, ferm3_Output;
double ferm4_Setpoint, ferm4_Input, ferm4_Output;

bool ferm1_Status, ferm2_Status, ferm3_Status, ferm4_Status;

// Specify the links and initial tuning parameters
// double Kp = 220, Ki = 2.5, Kd = 0;

// Petit fermenteur
double Kp = 70, Ki = 1, Kd = 0;
// Gros fermenteur 2 double Kp = 150, Ki = 1, Kd = 0; // J'ai mis le proportionelle a 150 pour le gros fermenteur.
double Kp2 = 150, Ki2 = 1, Kd2 = 0;

PID ferm1_pid(&ferm1_Input, &ferm1_Output, &ferm1_Setpoint, Kp, Ki, Kd, REVERSE);
PID ferm2_pid(&ferm2_Input, &ferm2_Output, &ferm2_Setpoint, Kp2, Ki2, Kd2, REVERSE);
PID ferm3_pid(&ferm3_Input, &ferm3_Output, &ferm3_Setpoint, Kp, Ki, Kd, REVERSE);
PID ferm4_pid(&ferm4_Input, &ferm4_Output, &ferm4_Setpoint, Kp, Ki, Kd, REVERSE);

unsigned WindowSize = 300; // In seconds

unsigned long ferm1_windowStartTime;
unsigned long ferm2_windowStartTime;
unsigned long ferm3_windowStartTime;
unsigned long ferm4_windowStartTime;

int ferm1_pid_i = 0;  // Iterator for interval execution
int ferm2_pid_i = 0;  // Iterator for interval execution
int ferm3_pid_i = 0;  // Iterator for interval execution
int ferm4_pid_i = 0;  // Iterator for interval execution
const int pid_T = 30; // PID computation interval in seconds
//************************ END PID **********************************

//************************ TEMPERATURE DEFINITION********************
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature sensors(&oneWire);

uint8_t TC1[8] = {0x28, 0x80, 0x5E, 0xD0, 0x4F, 0x20, 0x01, 0x33};
uint8_t TC2[8] = {0x28, 0xFC, 0x9E, 0x03, 0x00, 0x00, 0x80, 0x00}; // N'est pas branché
uint8_t TC3[8] = {0x28, 0xFF, 0x3F, 0xE2, 0x69, 0x18, 0x03, 0xBE}; //
uint8_t TC4[8] = {0x28, 0xFF, 0x96, 0xE7, 0x6F, 0x18, 0x01, 0x92};
uint8_t TC5[8] = {0x28, 0xFF, 0x34, 0xF8, 0x6F, 0x18, 0x01, 0x80};

MovingAverage<float, 8> ferm1MovAvg;
MovingAverage<float, 8> ferm2MovAvg;
MovingAverage<float, 8> ferm3MovAvg;
MovingAverage<float, 8> ferm4MovAvg;
unsigned long tc_read_interval_millis = 1000;
unsigned long tc_read_last_millis;
bool read_tc;
//************************ END TEMPERATURE DEFINITION ***************

// Generally, you should use "unsigned long" for variables that hold time
// The value will quickly become too large for an int to store

unsigned long previousMillis = 0;
unsigned long currentMillis = 0;

//*********** COMMUNICATION DATA STRUCTURE DEFINITION ***************
/**
  Create a data structure for transmitting and receiving data
  This allows many variables to be easily sent and received in a single transmission
  See http://www.cplusplus.com/doc/tutorial/structures/
*/

struct FermenterData
{
  float setpoint;
  float tc1TempC;
  double output;
  float nextPumpCycleTime;
  bool pumpStatus;
  bool fermStatus;

  // Method to serialize to JSON
  String toJson() {
    StaticJsonDocument<200> doc; // Adjust the size as per your data complexity
    doc["setpoint"] = setpoint;
    doc["tc1TempC"] = tc1TempC;
    doc["output"] = output;
    doc["nextPumpCycleTime"] = nextPumpCycleTime;
    doc["pumpStatus"] = pumpStatus;
    doc["fermStatus"] = fermStatus;
    
    String jsonOutput;
    serializeJson(doc, jsonOutput);
    return jsonOutput;
  }
};
FermenterData ferm1Data;
FermenterData ferm2Data;
FermenterData ferm3Data;
FermenterData ferm4Data;

struct ControlData
{
  double ferm1_setpoint;
  double ferm2_setpoint;
  double ferm3_setpoint;
  double ferm4_setpoint;
  bool ferm1_status;
  bool ferm2_status;
  bool ferm3_status;
  bool ferm4_status;
};

ControlData controlData;

//*********** END COMMUNICATION DATA STRUCTURE DEFINITION *************

//*********** FIRMWARE VARIABLES DEFINITIONS **************************
const long interval = 1000; // interval between temperature reading (milliseconds)

float TC1_tempC = 10;
float TC2_tempC = 10;
float TC3_tempC = 10;
float TC4_tempC = 10;
float TC5_tempC = 10;
float TC6_tempC = 10;

float ferm1AvgTemp = 0;
float ferm2AvgTemp = 0;
float ferm3AvgTemp = 0;
float ferm4AvgTemp = 0;

int i = 0;
//*********** END FIRMWARE VARIABLES DEFINITIONS **********************

//*********** Create a WebSocket server object on port 81 *************
WebSocketsServer webSocket = WebSocketsServer(3333);

void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
  switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\n", num);
      break;
    case WStype_CONNECTED:
      {
        IPAddress ip = webSocket.remoteIP(num);
        Serial.printf("[%u] Connection from ", num);
        Serial.println(ip.toString());
        
        // Send a welcome message to the client
        StaticJsonDocument<200> doc;
        doc["message"] = "Welcome to the WebSocket server!";
        String json;
        serializeJson(doc, json);
        webSocket.sendTXT(num, json);
      }
      break;
    case WStype_TEXT:
      Serial.printf("[%u] Received text: %s\n", num, payload);
      
      // Echo the received message back to the client
      webSocket.sendTXT(num, payload);
      break;
  }
}
//*********** END WebSocket server object on port 81 ******************

void setup()
{
  //************************ SERIAL COMM SETUP ************************
  Serial.begin(115200);
  Serial.println(" SETUP ");
  //************************ END SERIAL COMM SETUP ********************

  //************************ WIFI SETUP *******************************
  AsyncWiFiManager wifiManager(&server, &dns);
  wifiManager.autoConnect("AutoConnectAP");
  // Print ESP32 Local IP Address
  Serial.println(WiFi.localIP());
  //************************ END WIFI SETUP ***************************

