MichelGauvin/esp32_beer_ferm_ctrl/src/main.cpp
  //************************ START LITTLEFS SETUP *********************
  if (!LittleFS.begin ()) {
    Serial.println ("An Error has occurred while mounting LittleFS");
    return;
  }

  Dir dir = LittleFS.openDir ("");
    while (dir.next ()) {
      Serial.println ("Here the files:\r");
      Serial.println (dir.fileName ());
      Serial.println (dir.fileSize ());
    }
  //************************ END LITTLEFS SETUP ***********************

  //************************ START Route for root / web page *********/
  server.on("/", HTTP_GET, [](AsyncWebServerRequest * request) {
    request->send(LittleFS, "/index.html");
  });

  server.on("/temperature", HTTP_GET, [](AsyncWebServerRequest * request) {
    char str[20];
    sprintf(str, "%f", ferm1Data.tc1TempC);
    String temp1 = String(str);
    request->send_P(200, "text/plain", temp1.c_str());
  });
  //************************ END Route for root / web page ************

  // Send a GET request to <ESP_IP>/get?input1=<inputMessage> *********
  server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String inputMessage;
    String inputParam;
    
    // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
    if (request->hasParam(PARAM_INPUT_1)) {
      inputMessage = request->getParam(PARAM_INPUT_1)->value();
      inputParam = PARAM_INPUT_1;
    }
    
    Serial.println(inputMessage);
    
    request->send(200, "text/html", "HTTP GET request sent to your ESP on input field (" 
                                     + inputParam + ") with value: " + inputMessage +
                                     "<br><a href=\"/\">Return to Home Page</a>");
    
  });

  server.on("/ferm1data", HTTP_GET, [](AsyncWebServerRequest *request) {
  String json = "{\"setpoint\": " + String(ferm1Data.setpoint, 1) + 
                ", \"tc1TempC\": " + String(ferm1Data.tc1TempC, 1) +
                ", \"output\": " + String(ferm1Data.output) +
                ", \"nextPumpCycleTime\": " + String(ferm1Data.nextPumpCycleTime) +
                ", \"pumpStatus\": " + String(ferm1Data.pumpStatus) + "}";
  request->send(200, "application/json", json);
});
  // ******************************************************************
  server.begin();

  //************************ PID SETUP ********************************
  ferm1_windowStartTime = millis();
  ferm2_windowStartTime = millis();
  ferm3_windowStartTime = millis();
  ferm4_windowStartTime = millis();

  // initialize the variables we're linked to

  // Pour modifier manuellement le status et le setpoint des fermenteurs
  // dans le cas ou le RPI ne fonctionne pas.
  ferm1_Status = true;
  ferm2_Status = true;
  ferm3_Status = true;
  ferm4_Status = true;

  ferm1_Setpoint = 20;
  ferm2_Setpoint = 20;
  ferm3_Setpoint = 20;
  ferm4_Setpoint = 20;

  EEPROM.put(EEPROM_ADDR_SETPOINT1, ferm1_Setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT2, ferm2_Setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT3, ferm3_Setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT4, ferm4_Setpoint);

  EEPROM.put(EEPROM_ADDR_FERM1STATUS, ferm1_Status);
  EEPROM.put(EEPROM_ADDR_FERM2STATUS, ferm2_Status);
  EEPROM.put(EEPROM_ADDR_FERM3STATUS, ferm3_Status);
  EEPROM.put(EEPROM_ADDR_FERM4STATUS, ferm4_Status);

  // Fin de la configuration manuelle.

  EEPROM.get(EEPROM_ADDR_SETPOINT1, ferm1_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT2, ferm2_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT3, ferm3_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT4, ferm4_Setpoint);

  EEPROM.get(EEPROM_ADDR_FERM1STATUS, ferm1_Status);
  EEPROM.get(EEPROM_ADDR_FERM2STATUS, ferm2_Status);
  EEPROM.get(EEPROM_ADDR_FERM3STATUS, ferm3_Status);
  EEPROM.get(EEPROM_ADDR_FERM4STATUS, ferm4_Status);

  // tell the PID to range between 0 and the full window size
  ferm1_pid.SetOutputLimits(0, WindowSize / 10); // Limit maximum Ferm1_Output to 30 seconds every 5 minutes
  ferm2_pid.SetOutputLimits(0, WindowSize / 1);  // Limit maximum Ferm2_Output to 300 seconds every 5 minutes
  ferm3_pid.SetOutputLimits(0, WindowSize / 10); // Limit maximum Ferm3_Output to 30 seconds every 5 minutes
  ferm4_pid.SetOutputLimits(0, WindowSize / 10); // Limit maximum Ferm4_Output to 30 seconds every 5 minutes

  // turn the PID on
  ferm1_pid.SetMode(AUTOMATIC);
  ferm2_pid.SetMode(AUTOMATIC);
  ferm3_pid.SetMode(AUTOMATIC);
  ferm4_pid.SetMode(AUTOMATIC);

  //************************ END PID SETUP*****************************
  Serial.println(" SETUP_1 ");
  //************************ RELAY SETUP ******************************
  // We need to configure the pinMode to Ferm1_Input_PULLUP first
  // It avoids having a HIGH state when configuring the pinMode to Ferm1_Output.
  // IMPORTANT: WE INVERSE THE RELAY LOGIC BY DOING THIS
  // Issue #3 mikesbrewshop.com
  pinMode(RELAY1, INPUT_PULLUP);
  pinMode(RELAY1, OUTPUT);

  pinMode(RELAY2, INPUT_PULLUP);
  pinMode(RELAY2, OUTPUT);

  pinMode(RELAY3, INPUT_PULLUP);
  pinMode(RELAY3, OUTPUT);

  pinMode(RELAY4, INPUT_PULLUP);
  pinMode(RELAY4, OUTPUT);
  //************************ END RELAY SETUP ******************************

  //************************ TEMPERATURE READING SETUP ********************
  // Make asynchronous call to requestTempeature()
  sensors.begin();
  sensors.setWaitForConversion(false);
  sensors.requestTemperatures();
  tc_read_last_millis = millis();
  read_tc = false;

////************************ Start the WebSocket server *******************
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);

  Serial.println("WebSocket server started.");

  //************************ END TEMPERATURE READING SETUP ****************
  Serial.println(" ENDSETUP ");
}

void loop()
{

  // Handle WebSocket events
  webSocket.loop();

  currentMillis = millis();

  while ((currentMillis - previousMillis) < interval)
  {
    // Execute all other code between two temperature measurement.
    // Put the radio in listening mode, and verify for new ferm1_Setpoint.
    delay(500);
    currentMillis = millis();
    
    ferm1Data.output++;
    String json = ferm1Data.toJson();
    webSocket.broadcastTXT(json);

    // Read TC every tc_read_interval_millis = X ms
    if ((millis() - tc_read_last_millis) >= tc_read_interval_millis)
    {
      read_tc = true;
      tc_read_last_millis = millis();
    }
  }

  previousMillis = currentMillis;

  ferm1Data.setpoint = ferm1_Setpoint;
  ferm2Data.setpoint = ferm2_Setpoint;
  ferm3Data.setpoint = ferm3_Setpoint;
  ferm4Data.setpoint = ferm4_Setpoint;

  if (read_tc == true)
  {
    ferm1Data.tc1TempC = sensors.getTempC(TC1);
    ferm2Data.tc1TempC = sensors.getTempC(TC4); // On utilise ce TC pour le ferm2 puisque l'autre ne fonctionne plus bien.
    ferm3Data.tc1TempC = sensors.getTempC(TC3);
    ferm4Data.tc1TempC = sensors.getTempC(TC5);
    read_tc = false;
    // Calling requestTemperatures() here makes sure we leave enough time for the temperature conversion (1 second).
    sensors.requestTemperatures();
  }

  //************************ FERMENTER 1 PID LOOP *************************
  if (ferm1_Status == true)
  {
    if (ferm1Data.tc1TempC == -127)
    {
      // Do nothing
    }
    else
    {

      ferm1AvgTemp = ferm1MovAvg.add(ferm1Data.tc1TempC);
      ferm1_Input = ferm1AvgTemp;

      /************************************************
        Compute PID Ferm1_Output only every 30 seconds
      ************************************************/
      if (ferm1_pid_i + 1 >= pid_T)
      {
        ferm1_pid.Compute();
        ferm1_pid_i = 0;
        if (ferm1_Output < 2)
        {
          ferm1_Output = 0;
        }
      }
      else
      {
        ferm1_pid_i++;
      }

      /************************************************
        turn the ferm1_Output pin on/off based on pid ferm1_Output
      ************************************************/
      if (millis() - ferm1_windowStartTime > WindowSize * 1000)
      { // time to shift the Relay Window
        ferm1_windowStartTime += WindowSize * 1000;
      }
      if (ferm1_Output * 1000 < millis() - ferm1_windowStartTime)
      {
        digitalWrite(RELAY1, 1);
        ferm1Data.pumpStatus = false;
      }
      else
      {
        digitalWrite(RELAY1, 0);
        ferm1Data.pumpStatus = true;
      }
    }
  }
  else{
    ferm1_windowStartTime = millis();
  }
  //************************ END FERMENTER 1 PID LOOP *********************

  //************************ FERMENTER 2 PID LOOP *************************
  if (ferm2_Status == true)
  {
    if (ferm2Data.tc1TempC == -127)
    {
      // Do nothing
    }
    else
    {

