MichelGauvin/esp32_beer_ferm_ctrl/src/main.cpp
      ferm2AvgTemp = ferm2MovAvg.add(ferm2Data.tc1TempC);
      ferm2_Input = ferm2AvgTemp;

      /************************************************
        Compute PID ferm2_Output only every 30 seconds
      ************************************************/
      if (ferm2_pid_i + 1 >= pid_T)
      {
        ferm2_pid.Compute();
        ferm2_pid_i = 0;
        if (ferm2_Output < 2)
        {
          ferm2_Output = 0;
        }
      }
      else
      {
        ferm2_pid_i++;
      }

      /************************************************
        turn the ferm1_Output pin on/off based on pid ferm1_Output
      ************************************************/
      if (millis() - ferm2_windowStartTime > WindowSize * 1000)
      { // time to shift the Relay Window
        ferm2_windowStartTime += WindowSize * 1000;
      }
      if (ferm2_Output * 1000 < millis() - ferm2_windowStartTime)
      {
        digitalWrite(RELAY2, 1);
        ferm2Data.pumpStatus = false;
      }
      else
      {
        digitalWrite(RELAY2, 0);
        ferm2Data.pumpStatus = true;
      }
    }
  }
  else{
    ferm2_windowStartTime = millis();
  }
  //************************ END FERMENTER 2 PID LOOP *********************

  //************************ FERMENTER 3 PID LOOP *************************
  if (ferm3_Status == true)
  {
    if (ferm3Data.tc1TempC == -127)
    {
      // Do nothing
    }
    else
    {

      ferm3AvgTemp = ferm3MovAvg.add(ferm3Data.tc1TempC);
      ferm3_Input = ferm3AvgTemp;

      /************************************************
        Compute PID Ferm3_Output only every 30 seconds
      ************************************************/
      if (ferm3_pid_i + 1 >= pid_T)
      {
        ferm3_pid.Compute();
        ferm3_pid_i = 0;
        if (ferm3_Output < 2)
        {
          ferm3_Output = 0;
        }
      }
      else
      {
        ferm3_pid_i++;
      }

      /************************************************
        turn the ferm3_Output pin on/off based on pid ferm3_Output
      ************************************************/
      if (millis() - ferm3_windowStartTime > WindowSize * 1000)
      { // time to shift the Relay Window
        ferm3_windowStartTime += WindowSize * 1000;
      }
      if (ferm3_Output * 1000 < millis() - ferm3_windowStartTime)
      {
        digitalWrite(RELAY3, 1);
        ferm3Data.pumpStatus = false;
      }
      else
      {
        digitalWrite(RELAY3, 0);
        ferm3Data.pumpStatus = true;
      }
    }
  }
  else{
    ferm3_windowStartTime = millis();
  }
  //************************ END FERMENTER 3 PID LOOP *********************

  //************************ FERMENTER 4 PID LOOP *************************
  if (ferm4_Status == true)
  {
    if (ferm4Data.tc1TempC == -127)
    {
      // Do nothing
    }
    else
    {

      ferm4AvgTemp = ferm4MovAvg.add(ferm4Data.tc1TempC);
      ferm4_Input = ferm4AvgTemp;

      /************************************************
        Compute PID ferm4_Output only every 30 seconds
      ************************************************/
      if (ferm4_pid_i + 1 >= pid_T)
      {
        ferm4_pid.Compute();
        ferm4_pid_i = 0;
        if (ferm4_Output < 2)
        {
          ferm4_Output = 0;
        }
      }
      else
      {
        ferm4_pid_i++;
      }

      /************************************************
        turn the ferm4_Output pin on/off based on pid ferm4_Output
      ************************************************/
      if (millis() - ferm4_windowStartTime > WindowSize * 1000)
      { // time to shift the Relay Window
        ferm4_windowStartTime += WindowSize * 1000;
      }
      if (ferm4_Output * 1000 < millis() - ferm4_windowStartTime)
      {
        digitalWrite(RELAY4, 1);
        ferm4Data.pumpStatus = false;
      }
      else
      {
        digitalWrite(RELAY4, 0);
        ferm4Data.pumpStatus = true;
      }
    }
  }
  else{
    ferm4_windowStartTime = millis();
  }
  //************************ END FERMENTER 4 PID LOOP *********************

  //
  //   Send data to RPI every X seconds
  //

  ferm1Data.output = ferm1_Output;
  ferm2Data.output = ferm2_Output;
  ferm3Data.output = ferm3_Output;
  ferm4Data.output = ferm4_Output;

  // The +500 is to round to nearest integer
  if (ferm1_Status == true)
  {
    ferm1Data.nextPumpCycleTime = ((WindowSize * 1000 - (millis() - ferm1_windowStartTime)) + 500) / 1000;
  }
  else
  {
    ferm1Data.nextPumpCycleTime = 0;
    ferm1Data.output = 0;
    // TODO If pump is "ON" turn it "OFF".
    // This will also check for a master pump control in the future, the logic will also be implemented in the pid loop
    // Master pump control let the operator to force the pump ON for the desired duration via web command
  }
  if (ferm2_Status == true)
  {
    ferm2Data.nextPumpCycleTime = (WindowSize * 1000 - (millis() - ferm2_windowStartTime)) / 1000;
  }
  else
  {
    ferm2Data.nextPumpCycleTime = 0;
    ferm2Data.output = 0;
    // TODO If pump is "ON" turn it "OFF".
    // This will also check for a master pump control in the future, the logic will also be implemented in the pid loop
    // Master pump control let the operator to force the pump ON for the desired duration
  }
  if (ferm3_Status == true)
  {
    ferm3Data.nextPumpCycleTime = (WindowSize * 1000 - (millis() - ferm3_windowStartTime)) / 1000;
  }
  else
  {
    ferm3Data.nextPumpCycleTime = 0;
    ferm3Data.output = 0;
    // TODO If pump is "ON" turn it "OFF".
    // This will also check for a master pump control in the future, the logic will also be implemented in the pid loop
    // Master pump control let the operator to force the pump ON for the desired duration
  }
  if (ferm4_Status == true)
  {
    ferm4Data.nextPumpCycleTime = (WindowSize * 1000 - (millis() - ferm4_windowStartTime)) / 1000;
  }
  else
  {
    ferm4Data.nextPumpCycleTime = 0;
    ferm4Data.output = 0;
    // TODO If pump is "ON" turn it "OFF".
    // This will also check for a master pump control in the future, the logic will also be implemented in the pid loop
    // Master pump control let the operator to force the pump ON for the desired duration
  }

  // First, stop listening so we can talk.
  // radio.stopListening();

  // Send data for the 4 fermenters
  /*
  String message1 = "Fermenteur 1: Setpoint = " + (String)ferm1Data.setpoint + "\tTC1= " + (String)ferm1Data.tc1TempC + "\tOutput = " + (String)ferm1Data.output + "\tnextPumpCycleTime = " + ferm1Data.nextPumpCycleTime + "\tpumpStatus = " + (String)ferm1Data.pumpStatus;
  String message2 = "Fermenteur 2: Setpoint = " + (String)ferm2Data.setpoint + "\tTC2= " + (String)ferm2Data.tc1TempC + "\tOutput = " + (String)ferm2Data.output + "\tnextPumpCycleTime = " + ferm2Data.nextPumpCycleTime + "\tpumpStatus = " + (String)ferm2Data.pumpStatus;
  String message3 = "Fermenteur 3: Setpoint = " + (String)ferm3Data.setpoint + "\tTC3= " + (String)ferm3Data.tc1TempC + "\tOutput = " + (String)ferm3Data.output + "\tnextPumpCycleTime = " + ferm3Data.nextPumpCycleTime + "\tpumpStatus = " + (String)ferm3Data.pumpStatus;
  String message4 = "Fermenteur 4: Setpoint = " + (String)ferm4Data.setpoint + "\tTC4= " + (String)ferm4Data.tc1TempC + "\tOutput = " + (String)ferm4Data.output + "\tnextPumpCycleTime = " + ferm4Data.nextPumpCycleTime + "\tpumpStatus = " + (String)ferm4Data.pumpStatus;

  String message = "****************************\r\n" + message1 + "\r\n" + message2 + "\r\n" + message3 + "\r\n" + message4;
  Serial.println(message);
*/
/*
  EEPROM.put(EEPROM_ADDR_SETPOINT1, controlData.ferm1_setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT2, controlData.ferm2_setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT3, controlData.ferm3_setpoint);
  EEPROM.put(EEPROM_ADDR_SETPOINT4, controlData.ferm4_setpoint);
  EEPROM.put(EEPROM_ADDR_FERM1STATUS, controlData.ferm1_status);
  EEPROM.put(EEPROM_ADDR_FERM2STATUS, controlData.ferm2_status);
  EEPROM.put(EEPROM_ADDR_FERM3STATUS, controlData.ferm3_status);
  EEPROM.put(EEPROM_ADDR_FERM4STATUS, controlData.ferm4_status);
  EEPROM.get(EEPROM_ADDR_SETPOINT1, ferm1_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT2, ferm2_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT3, ferm3_Setpoint);
  EEPROM.get(EEPROM_ADDR_SETPOINT4, ferm4_Setpoint);
  EEPROM.get(EEPROM_ADDR_FERM1STATUS, ferm1_Status);
  EEPROM.get(EEPROM_ADDR_FERM2STATUS, ferm2_Status);
  EEPROM.get(EEPROM_ADDR_FERM3STATUS, ferm3_Status);
  EEPROM.get(EEPROM_ADDR_FERM4STATUS, ferm4_Status);
  ferm1Data.fermStatus = ferm1_Status;
  ferm2Data.fermStatus = ferm2_Status;
  ferm3Data.fermStatus = ferm3_Status;
  ferm4Data.fermStatus = ferm4_Status;
  */

}
